#Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:



#Попросіть користувача ввести свсвій вік (можно використати константу або input()).

#- якщо користувачу менше 7 - вивести "Де твої батьки?"

#- якщо користувачу менше 16 - вивести "Це фільм для дорослих!"

#- якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"

#- якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років) - вивести "Який цікавий вік!"

#- у будь-якому іншому випадку - вивести "А білетів вже немає!"

age = input('Укажите свой полный возраст')
age = age.replace(' ', '')

if age.isdigit() == True:
    age = int(age)
else:
    print('Не верный возраст')
    exit()

age_str = str(age)
counter = len(age_str) - 1
print(age_str[counter])
#while counter > 0:




