#Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
#Попросіть користувача ввести свсвій вік (можно використати константу або input()).
#- якщо користувачу менше 7 - вивести "Де твої батьки?"
#- якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
#- якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
#- якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років) - вивести "Який цікавий вік!"
#- у будь-якому іншому випадку - вивести "А білетів вже немає!"

age = input('Укажите свой полный возраст')
age = age.replace(' ', '')
age = age.lstrip('0')

if age.isdigit() == True:
    age = int(age)
else:
    print('Не верный возраст')
    exit()

age_str = str(age)
counter = len(age_str) - 1
if counter > 0:
    while counter > 0:
        if int(age_str[counter]) == int(age_str[counter-1]): #последовательно сравниваю
            counter -= 1                                     #значения от последнего до нулевого индекса
        else:
            break
    if counter == 0:
         print('Какой интересный возраст!')

if age <= 7:
    print('Где твои родители?')
elif 7 < age <= 16:
    print('Это фильм для взрослых')
elif age >= 65 :
    print('Покажите пенсионное удостоверение')
else:
    print('А билетов уже нет!')





