# 1.Зформуйте строку, яка містить певну інформацію про символ в відомому слові.
#Наприклад "The [значення нокра символа] symbol in [тут слово] is '[символ з відповідним порядковим номером]'".
# Слово та номер отримайте за допомогою input() або скористайтеся константою.
# Наприклад (слово - "Python" а номер символу 3) - "The 3 symbol in "Python" is 't' ".

# 2.Вести з консолі строку зі слів (або скористайтеся константою).
# Напишіть код, який визначить кількість кількість слів, в цмх даних.

# 3.Існує ліст з різними даними,
# наприклад lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum'].
# Напишіть механізм, який сфлрмує новий list (наприклад lst2), який би містив всі числові змінні, які є в lst1.
# Майте на увазі, що данні в lst1 не є статичними можуть змінюватись від запуску до запуску.

new_word = ''
new_number = ''
print('Зформуйте строку, яка містить певну інформацію про символ в відомому слові.')
while not new_word.isalpha() or not len(new_word) > 0:
    new_word = input('Введите слово ---> ').replace(' ', '')

    if not new_word.isalpha():
        print('Данные не являются словом')

while not new_number.isdigit() or str(new_number) > len(new_word):
    new_number = input('Введите число ---> ').replace(' ', '')

    if not new_number.new_number():
        print('Данные не являются числом')
    elif str(new_number) > len(new_word):
        print('Число слишком большое')